In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset = {
        "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
        "Çalışan": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
        "Maaş":[3000,3500,2500,4500,4000,2000]
        }

In [3]:
df = pd.DataFrame(dataset)

In [4]:
df

          Departman  Çalışan  Maaş
0           Bilişim  Mustafa  3000
1  İnsan Kaynakları     Jale  3500
2            Üretim    Kadir  2500
3            Üretim   Zeynep  4500
4           Bilişim    Murat  4000
5  İnsan Kaynakları    Ahmet  2000

In [6]:
DepGroup = df.groupby("Departman")

In [8]:
list(DepGroup)

[('Bilişim',
    Departman  Çalışan  Maaş
  0   Bilişim  Mustafa  3000
  4   Bilişim    Murat  4000),
 ('Üretim',
    Departman Çalışan  Maaş
  2    Üretim   Kadir  2500
  3    Üretim  Zeynep  4500),
 ('İnsan Kaynakları',
            Departman Çalışan  Maaş
  1  İnsan Kaynakları    Jale  3500
  5  İnsan Kaynakları   Ahmet  2000)]

In [9]:
DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [14]:
int(df.groupby("Departman").sum().loc["Bilişim"])

7000

In [16]:
df.groupby("Departman").count()

                  Çalışan  Maaş
Departman
Bilişim                 2     2
Üretim                  2     2
İnsan Kaynakları        2     2

In [25]:
df.groupby("Departman").max()

                  Çalışan  Maaş
Departman
Bilişim           Mustafa  4000
Üretim             Zeynep  4500
İnsan Kaynakları     Jale  3500

In [26]:
df.groupby("Departman").mean()

                  Maaş
Departman
Bilişim           3500
Üretim            3500
İnsan Kaynakları  2750